In [59]:
import pandas as pd

In [60]:
df = df.rename(columns = {})

In [61]:
url = 'https://raw.githubusercontent.com/lenhattung/SP26-AI1904-DAP391m/refs/heads/main/lab_part_2/01%20-%20Linear%20and%20logistic%20regression/titanic.csv'
df = pd.read_csv(url)

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  1309 non-null   int64
 1   pclass        1309 non-null   int64
 2   survived      1309 non-null   int64
 3   name          1309 non-null   object
 4   sex           1309 non-null   int64
 5   age           1046 non-null   float64
 6   sibsp         1309 non-null   int64
 7   parch         1309 non-null   int64
 8   ticket        1309 non-null   object
 9   fare          1308 non-null   float64
 10  cabin         295 non-null    object
 11  embarked      1307 non-null   object
 12  boat          486 non-null    object
 13  body          121 non-null    float64
 14  home.dest     745 non-null    object
dtypes: float64(3), int64(6), object(6)
memory usage: 153.5+ KB

In [63]:
df.head()

,passenger_id,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,1,"Allen, Miss. Elisabeth Walton",1,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,2,1,1,"Allison, Master. Hudson Trevor",0,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,3,1,0,"Allison, Miss. Helen Loraine",1,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,4,1,0,"Allison, Mr. Hudson Joshua Creighton",0,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,5,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [64]:
df['passenger_id'].unique()

array([   1,    2,    3, ..., 1307, 1308, 1309])

In [65]:
df.describe()

,passenger_id,pclass,survived,sex,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,655.000000,2.294882,0.381971,0.355997,29.881135,0.498854,0.385027,33.295479,160.809917
std,378.020061,0.837836,0.486055,0.478997,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,1.000000,0.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,328.000000,2.000000,0.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,655.000000,3.000000,0.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,982.000000,3.000000,1.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,1309.000000,3.000000,1.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In [66]:
df.shape

(1309, 15)

In [67]:
df.size

19635

In [68]:
df['passenger_id'].value_counts()

passenger_id
1309    1
1       1
2       1
3       1
4       1
       ..
33      1
34      1
35      1
36      1
37      1
Name: count, Length: 1309, dtype: int64

In [69]:
df['pclass'].unique()

array([1, 2, 3])

In [70]:
df['sex'] = df['sex'].replace({'0' : 'Male',
                               '1' : 'Female'})

In [71]:
df['pclass'] = df['pclass'].replace({1 : '1st',
                                     2 : '2nd',
                                     3 : '3rd'})
print(df.head())

   passenger_id pclass  survived  \
0             1    1st         1
1             2    1st         1
2             3    1st         0
3             4    1st         0
4             5    1st         0

                                              name  sex      age  sibsp  \
0                    Allen, Miss. Elisabeth Walton    1  29.0000      0
1                   Allison, Master. Hudson Trevor    0   0.9167      1
2                     Allison, Miss. Helen Loraine    1   2.0000      1
3             Allison, Mr. Hudson Joshua Creighton    0  30.0000      1
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)    1  25.0000      1

   parch  ticket      fare    cabin embarked boat   body  \
0      0   24160  211.3375       B5        S    2    NaN
1      2  113781  151.5500  C22 C26        S   11    NaN
2      2  113781  151.5500  C22 C26        S  NaN    NaN
3      2  113781  151.5500  C22 C26        S  NaN  135.0
4      2  113781  151.5500  C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON

In [72]:
df['Name'] = df['name'].str.split(',').str[0]
df['SUrname'] = df['name'].str.split('.').str[1]

In [73]:
df['survived'] = df['survived'].replace({0 : 'No',
                        1 : 'Yes'})

In [74]:
df.head()

,passenger_id,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,Name,SUrname
0,1,1st,Yes,"Allen, Miss. Elisabeth Walton",1,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",Allen,Elisabeth Walton
1,2,1st,Yes,"Allison, Master. Hudson Trevor",0,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",Allison,Hudson Trevor
2,3,1st,No,"Allison, Miss. Helen Loraine",1,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",Allison,Helen Loraine
3,4,1st,No,"Allison, Mr. Hudson Joshua Creighton",0,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",Allison,Hudson Joshua Creighton
4,5,1st,No,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",Allison,Hudson J C (Bessie Waldo Daniels)

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 17 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  1309 non-null   int64
 1   pclass        1309 non-null   object
 2   survived      1309 non-null   object
 3   name          1309 non-null   object
 4   sex           1309 non-null   int64
 5   age           1046 non-null   float64
 6   sibsp         1309 non-null   int64
 7   parch         1309 non-null   int64
 8   ticket        1309 non-null   object
 9   fare          1308 non-null   float64
 10  cabin         295 non-null    object
 11  embarked      1307 non-null   object
 12  boat          486 non-null    object
 13  body          121 non-null    float64
 14  home.dest     745 non-null    object
 15  Name          1309 non-null   object
 16  SUrname       1309 non-null   object
dtypes: float64(3), int64(4), object(10)
memory usage: 174.0+ KB

In [81]:
df.dropna(subset = ['age'], inplace = True)

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1046 entries, 0 to 1308
Data columns (total 17 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  1046 non-null   int64
 1   pclass        1046 non-null   object
 2   survived      1046 non-null   object
 3   name          1046 non-null   object
 4   sex           1046 non-null   int64
 5   age           1046 non-null   float64
 6   sibsp         1046 non-null   int64
 7   parch         1046 non-null   int64
 8   ticket        1046 non-null   object
 9   fare          1045 non-null   float64
 10  cabin         272 non-null    object
 11  embarked      1044 non-null   object
 12  boat          417 non-null    object
 13  body          120 non-null    float64
 14  home.dest     685 non-null    object
 15  Name          1046 non-null   object
 16  SUrname       1046 non-null   object
dtypes: float64(3), int64(4), object(10)
memory usage: 147.1+ KB